{
  "name": "Mana Gems",
  "icon": "reborn12k:sapphire",
  "advancement": "reborn12k:reborn12k_magic/magic_within",
  "category": "reborn12k:magic",
  "pages": [
    {
      "type": "patchouli:text",
      "title": "Mana Gems",
      "text": "Your first lesson will be... Runes! We're gonna be using Mana Gems, so grab som... You don't know what Mana Gems are? Ok, ok, no worries, let's do some basics. I assume you already know about Diamonds and Emeralds right? Ok, that's good. Those two are Mana Gems, crystals attuned to a particular element. In total there are six gems:"
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:diamond",
      "text": "Diamonds are the first Mana Gems we're gonna talk about. Rare and precious crystals that can be used to make strong tools and armors. But that's not all. Diamonds are magically attuned to Air, allowing you to imbue the power of Air and bend it to your will."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:emerald",
      "text": "Emeralds are the Mana Gems of Earth. Some time ago it started to be used as a currency, and it has become incredibly rare to find since. Trading is the easist way to obtain it, but can still be found naturally in mountainous biomes."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reborn12k:sapphire",
      "text": "A variety of Corundum, Sapphire is the third most durable material in the world. Although Sapphires are best-known as blue, they can be of any color, even black or completely transparent. As the Mana Gems of Water, they can be found under the ocean bed."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reborn12k:ruby",
      "text": "When a Corundum is born, an high concentration of chromium gives the crystal a bright red tint. Those red Corundums are known as Rubies, the Mana Gems of Fire. Ruby minerals can be found underground, where once a lava pit was."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reborn12k:opal",
      "text": "The name Opal derives from the Greek word $(o)'opállios'$(), which means 'to see a change in color'. This is because an Opal displays every color of the visible spectrum when struck by white light, no matter its original color. Easy to get why Opals are the Mana Gems of Light."
    },
    {
      "type": "patchouli:spotlight",
      "item": "minecraft:amethyst_shard",
      "text": "The violet Quartz known as Amethyst is arguably the most common of all the Mana Gems. As the Mana Gem of Darkness, it thrives and grows in the shadows. Even if associated to an element believed to be evil, Amethysts were used as a personal ward against harm."
    },
    {
      "type": "patchouli:spotlight",
      "item": "reborn12k:manatite",
      "text": "I know I said there were six total Mana Gems. But this technically isn't a Gem. Ok it is, but Manatites don't have an attunement and cannot be used by themselves. Imagine them like an enormous battery of crystallized mana. They are exceptionally rare, but some people might sell you them. If you pay."
    }
  ],
  "sortnum": 101
}